In [26]:
import pandas as pd
import numpy as np

In [27]:
x=pd.Series([10,20,30,40,50],name="numbers")
y=pd.Series(["a","b","c","d","e"],name="chars")
z=pd.concat([x,y],axis=1)
z

   numbers chars
0       10     a
1       20     b
2       30     c
3       40     d
4       50     e

In [28]:
l=pd.Series(["agra","bareilly","lucknow","banaras","kanpur"],name="cities")
z=pd.concat([z,l],axis=1)
z.head()

   numbers chars    cities
0       10     a      agra
1       20     b  bareilly
2       30     c   lucknow
3       40     d   banaras
4       50     e    kanpur

In [29]:
#using apply function
z["numbers"]=z["numbers"].apply(lambda x:x*2)
z["numbers"]

0     20
1     40
2     60
3     80
4    100
Name: numbers, dtype: int64

In [30]:
z.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
numbers    5 non-null int64
chars      5 non-null object
cities     5 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [31]:
z.index

RangeIndex(start=0, stop=5, step=1)

In [32]:
z.set_index("numbers",inplace=True)
z.head()

        chars    cities
numbers
20          a      agra
40          b  bareilly
60          c   lucknow
80          d   banaras
100         e    kanpur

In [33]:
z.index

Int64Index([20, 40, 60, 80, 100], dtype='int64', name='numbers')

In [34]:
z.reset_index(inplace=True)
z.head()

   numbers chars    cities
0       20     a      agra
1       40     b  bareilly
2       60     c   lucknow
3       80     d   banaras
4      100     e    kanpur

In [35]:
#getting 3rd row and all columns
z.loc[3:]

   numbers chars   cities
3       80     d  banaras
4      100     e   kanpur

In [36]:
#getting all rows and only numbers columns
z.loc[:,"numbers"]

0     20
1     40
2     60
3     80
4    100
Name: numbers, dtype: int64

In [41]:
#getting row having number 80 
#z.loc[z.numbers==80]
z.loc[z.numbers==80,:]  #better coding

   numbers chars   cities
3       80     d  banaras

In [38]:
z.head()

   numbers chars    cities
0       20     a      agra
1       40     b  bareilly
2       60     c   lucknow
3       80     d   banaras
4      100     e    kanpur

In [39]:
#getting the row with number as 40 and chars as c
z.loc[(z.numbers==40) |(z.chars=="c")]

   numbers chars    cities
1       40     b  bareilly
2       60     c   lucknow

In [43]:
z.head()

   numbers chars    cities
0       20     a      agra
1       40     b  bareilly
2       60     c   lucknow
3       80     d   banaras
4      100     e    kanpur

In [44]:
#show only cities columns with numbers as 100
z.loc[z.numbers==100,"cities"]

4    kanpur
Name: cities, dtype: object

In [45]:
z.head()

   numbers chars    cities
0       20     a      agra
1       40     b  bareilly
2       60     c   lucknow
3       80     d   banaras
4      100     e    kanpur

In [46]:
#find the data where city is bareilly and chars as c and  and numbers as 100
z.loc[(z.numbers==100)|(z.chars=="c")|(z.cities=="bareilly")]

   numbers chars    cities
1       40     b  bareilly
2       60     c   lucknow
4      100     e    kanpur

In [47]:
z.head()

   numbers chars    cities
0       20     a      agra
1       40     b  bareilly
2       60     c   lucknow
3       80     d   banaras
4      100     e    kanpur

In [48]:
#using ILOC for index wise selection
#all rows and second column
z.iloc[:,1]

0    a
1    b
2    c
3    d
4    e
Name: chars, dtype: object

In [50]:
#3rd rows and all columns
z.iloc[2:]   #this is wrong i know

   numbers chars   cities
2       60     c  lucknow
3       80     d  banaras
4      100     e   kanpur

In [53]:
z.head()

   numbers chars    cities
0       20     a      agra
1       40     b  bareilly
2       60     c   lucknow
3       80     d   banaras
4      100     e    kanpur

In [52]:
#correct way  index 2 is the third row.
z.iloc[2:3,:]

   numbers chars   cities
2       60     c  lucknow

In [57]:
#only 2nd row and cities columns #here you can't do this you need ix which is a mix of loc and iloc
z.iloc[2:3,"cities"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [63]:
#row 3 with city column only
z.iloc[2:3,2:3]

    cities
2  lucknow

In [66]:
#lets do this using ix
z.ix[2:2,"cities"]

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

2    lucknow
Name: cities, dtype: object